vincent290587/nRF5x/main.c
    switch (event)
    {
        case ANT_BSC_PAGE_0_UPDATED:
            /* fall through */
        case ANT_BSC_PAGE_1_UPDATED:
            /* fall through */
        case ANT_BSC_PAGE_2_UPDATED:
            /* fall through */
        case ANT_BSC_PAGE_3_UPDATED:
            /* fall through */
        case ANT_BSC_PAGE_4_UPDATED:
            /* fall through */
        case ANT_BSC_PAGE_5_UPDATED:
            /* Log computed value */

            break;

        case ANT_BSC_COMB_PAGE_0_UPDATED:
          
            _speed = calculate_speed(p_profile->BSC_PROFILE_speed_rev_count, p_profile->BSC_PROFILE_speed_event_time);
        
            _cadence = calculate_cadence(p_profile->BSC_PROFILE_cadence_rev_count, p_profile->BSC_PROFILE_cadence_event_time);
                         
#if (NRF_LOG_USES_RTT==1)
        log_rtt_printf(0, "Evenement BSC speed=%u cad=%u\n", _speed, _cadence);
#endif
            break;

        default:
            break;
    }
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Start advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_start(&m_adv_params);
    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_HANDLER(err_code);
    }

    //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    //APP_ERROR_CHECK(err_code);
}


/**@brief Start receiving the ANT HRM data.
 */
static void ant_hrm_rx_start(void * p_context)
{
    uint32_t err_code = ant_hrm_disp_open(&m_ant_hrm);
    APP_ERROR_CHECK(err_code);
}

/**@brief Start receiving the ANT HRM data.
 */
static void ant_bsc_rx_start(void * p_context)
{
    uint32_t err_code = ant_bsc_disp_open(&m_ant_bsc);
    APP_ERROR_CHECK(err_code);
}


/**@brief Attempt to both open the ant channel and start ble advertising.
*/
static void ant_and_adv_start(void)
{
    advertising_start();
    ant_hrm_rx_start(NULL);
	  ant_bsc_rx_start(NULL);
}


#ifdef USE_TUNES
static void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    pwm_ready = 1;
}



static void sec_tune(void * p_context) {
   play_tune();
}
#endif

uint8_t encode (uint8_t byte) {
  
   switch (byte) {
     case '$':
       status_byte = 0;
       //memset(read_byte, 0, sizeof(read_byte));
     
       break;
     case '\n':
       status_byte = 0;
       
#ifdef USE_TUNES
		   if (read_byte[0]=='T' && read_byte[1]=='U') {
				 switch(read_byte[2]) {
				   case '0':
						 play_mario();
						 break;
					 case '1':
						 break;
				 }
				 return 0;
			 }
#endif
       return 1;
     
     default:
       if (status_byte < sizeof(read_byte) - 10) {
         read_byte[status_byte] = byte;
         status_byte++;
       } else {
         status_byte = 0;
       }
       break;
   }
  
   return 0;
}


#ifdef USE_TUNES
static void pwm_start(uint32_t period_us) {
  
    /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_2CH(period_us, 22, 24);
    
    /* Switch the polarity of the second channel. */
    pwm1_cfg.pin_polarity[1] = APP_PWM_POLARITY_ACTIVE_HIGH;

    /* Initialize and enable PWM. */
    uint32_t err_code = app_pwm_init(&PWM1,&pwm1_cfg, pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    app_pwm_enable(&PWM1);
  
    pwm_ready = 0;
    while (app_pwm_channel_duty_set(&PWM1, 0, 50) == NRF_ERROR_BUSY) {
      nrf_delay_ms(1);
    }
    while (!pwm_ready) {
      nrf_delay_ms(1);
    }
    APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, 50));
    
}


static void pwm_stop() {
    app_pwm_disable(&PWM1);
    uint32_t err_code = app_pwm_uninit(&PWM1);
    APP_ERROR_CHECK(err_code);
}

static void play_mario() {
   isTunePlaying = 0;
   iTune = NOTES_NB;
   play_tune ();
}


static void play_tune (void) {
  
  uint32_t err_code, delay, period_us;
  
  if (iTune > 1) {
    // indice non nul
    if (isTunePlaying) {
      // on vient de jouer une note
      // on joue un blanc
      isTunePlaying = 0;
      pwm_stop();
      delay = APP_TIMER_TICKS(1000 / tempo[NOTES_NB - iTune], APP_TIMER_PRESCALER);
      err_code = app_timer_start(m_sec_tune, delay, NULL);
      APP_ERROR_CHECK(err_code);
      
      iTune--;
    } else {
      // on vient de jouer un blanc ou on commence
      if (iTune - 1 > 1) {
        // on relance
        if (melody[NOTES_NB - iTune] > 0) {
          period_us = 1000000 / melody[NOTES_NB - iTune];
          pwm_start(period_us);
        }
        delay = APP_TIMER_TICKS(1300 / tempo[NOTES_NB - iTune], APP_TIMER_PRESCALER);
        err_code = app_timer_start(m_sec_tune, delay, NULL);
        APP_ERROR_CHECK(err_code);
      }
      
      isTunePlaying = 1;
    }
    
  }
  
}
#endif

/**@brief Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
	  uint32_t err_code;
	
    // Initialize timer module
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
	
	  err_code = app_timer_create(&m_sec_hrm, APP_TIMER_MODE_SINGLE_SHOT, ant_hrm_rx_start);
    APP_ERROR_CHECK(err_code);
  
    err_code = app_timer_create(&m_sec_cad, APP_TIMER_MODE_SINGLE_SHOT, ant_bsc_rx_start);
    APP_ERROR_CHECK(err_code);
  
#ifdef USE_TUNES
    err_code = app_timer_create(&m_sec_tune, APP_TIMER_MODE_SINGLE_SHOT, sec_tune);
    APP_ERROR_CHECK(err_code);
#endif
}


