vincent290587/nRF5x/main.c
    // Wait for events    
    err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

	  //Configure WDT.
#if (WDT_ENABLED == 1)
    nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&wdt_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();
#endif
	
    // Initialize peripherals
    timers_init();
	
#if (NRF_LOG_USES_RTT == 1)
	  log_rtt_init();
#endif
	
	  // UART init
	  uart_init();

    // Initialize S332 SoftDevice & ANT
    ble_ant_stack_init();

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_evt_handler);
    APP_ERROR_CHECK(err_code);


    // Initialize Bluetooth stack parameters.
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
	

    uint32_t count; 

    // Initialize device manager.
    device_manager_init();

    err_code = pstorage_access_status_get(&count);
    if ((err_code == NRF_SUCCESS) && (count == 0))

    {
        ant_and_adv_start();
    }
    
#if (NRF_LOG_USES_RTT==1)
    log_rtt_printf(0, "Start !!\n"); 
#endif

    // Enter main loop.
    for (;;)
    {
        power_manage();
			
#if (WDT_ENABLED == 1)
			  // WDT feed
        nrf_drv_wdt_channel_feed(wdt_channel_id);
#endif
    }
}

/** 
 * @}
 */
